## Analising EUA and Australia, what is the gender with most attacks?

In [630]:
import pandas as pd

In [631]:
shark = pd.read_csv('GSAF5.csv', encoding='latin-1')

In [632]:
shark[['Country', 'Sex ', 'Date']]

                 Country Sex          Date
0                    USA    M    18-Sep-16
1                    USA    M    18-Sep-16
2                    USA    M    18-Sep-16
3              AUSTRALIA    M    17-Sep-16
4              AUSTRALIA    M    16-Sep-16
...                  ...  ...          ...
5987           AUSTRALIA    M  Before 1903
5988           AUSTRALIA    M  Before 1903
5989                 USA    M    1900-1905
5990              PANAMA    M    1883-1889
5991  CEYLON (SRI LANKA)    M    1845-1853

[5992 rows x 3 columns]

In [634]:
shark_list = shark[['Country', 'Sex ', 'Date']].dropna() #it had no information
shark_list

                 Country Sex          Date
0                    USA    M    18-Sep-16
1                    USA    M    18-Sep-16
2                    USA    M    18-Sep-16
3              AUSTRALIA    M    17-Sep-16
4              AUSTRALIA    M    16-Sep-16
...                  ...  ...          ...
5987           AUSTRALIA    M  Before 1903
5988           AUSTRALIA    M  Before 1903
5989                 USA    M    1900-1905
5990              PANAMA    M    1883-1889
5991  CEYLON (SRI LANKA)    M    1845-1853

[5385 rows x 3 columns]

In [611]:
to_treat = []
def is_sex(x):
    if x=='M' or x=='F':
        return True
    else:
        return to_treat.append(x)
shark_list['Sex '].map(is_sex)
to_treat

['M ', 'M ', 'lli', 'N', '.']

In [612]:
shark_list['Sex '] = shark_list['Sex '].replace(to_replace = ['M ','N'], value= 'M', regex=True) 
shark_list

                 Country Sex          Date
0                    USA    M    18-Sep-16
1                    USA    M    18-Sep-16
2                    USA    M    18-Sep-16
3              AUSTRALIA    M    17-Sep-16
4              AUSTRALIA    M    16-Sep-16
...                  ...  ...          ...
5987           AUSTRALIA    M  Before 1903
5988           AUSTRALIA    M  Before 1903
5989                 USA    M    1900-1905
5990              PANAMA    M    1883-1889
5991  CEYLON (SRI LANKA)    M    1845-1853

[5385 rows x 3 columns]

In [613]:
shark_list["Country"].value_counts()

USA                             2016
AUSTRALIA                       1136
SOUTH AFRICA                     501
PAPUA NEW GUINEA                 115
NEW ZEALAND                      110
                                ...
ITALY / CROATIA                    1
EQUATORIAL GUINEA / CAMEROON       1
KUWAIT                             1
CYPRUS                             1
RED SEA                            1
Name: Country, Length: 194, dtype: int64

In [614]:
mask = shark_list['Country'] == 'USA'
shark_usa = shark_list[mask]
shark_usa

     Country Sex                          Date
0        USA    M                    18-Sep-16
1        USA    M                    18-Sep-16
2        USA    M                    18-Sep-16
6        USA    M                    11-Sep-16
7        USA    F                    07-Sep-16
...      ...  ...                          ...
5939     USA    M                  Before 1958
5973     USA    M                  Before 1921
5978     USA    M  Before          17-Jul-1916
5982     USA    F                   Circa 1862
5989     USA    M                    1900-1905

[2016 rows x 3 columns]

In [615]:
#Drop feito para eliminar um dado indecifrável onde não é possível distinguir o gênero.
df_usa = pd.DataFrame(shark_usa['Sex '].value_counts().reset_index().rename(columns = {'index':'Gender', 'Sex ': 'Qtd'})).drop(index=2)
df_usa_porcentagem = df_usa['Qtd']/(df_usa['Qtd'].sum())
df_usa_porcentagem

0    0.847146
1    0.152854
Name: Qtd, dtype: float64

In [616]:
shark_usa["Date"].value_counts()

05-Oct-03               5
12-Apr-01               5
28-Jul-95               5
20-Sep-15               4
14-Jun-12               4
                       ..
Reported 29-Nov-2005    1
06-Sep-76               1
08-Nov-11               1
20-Jul-69               1
28-Aug-08               1
Name: Date, Length: 1800, dtype: int64

In [617]:
pattern = '\-(\D+)\-'
mes = shark_usa['Date'].apply(lambda x: re.findall(pattern, x))

In [618]:
mes

0       [Sep]
1       [Sep]
2       [Sep]
6       [Sep]
7       [Sep]
        ...
5939       []
5973       []
5978    [Jul]
5982       []
5989       []
Name: Date, Length: 2016, dtype: object

In [619]:
ds_mes = pd.Series(mes)
ds_mes.value_counts()

[Jul]         306
[Aug]         289
[Sep]         252
[Jun]         223
[Oct]         181
[]            153
[May]         138
[Apr]         133
[Nov]         104
[Mar]          88
[Dec]          55
[Feb]          48
[Jan]          42
[Aug-]          2
[Sept]          1
[Jan, Jan]      1
Name: Date, dtype: int64

In [620]:
ds_mes = ds_mes.apply(lambda x : x[0] if len(x)>0 else '')

In [621]:
ds_mes

0       Sep
1       Sep
2       Sep
6       Sep
7       Sep
       ...
5939
5973
5978    Jul
5982
5989
Name: Date, Length: 2016, dtype: object

In [622]:
months_correct = ['Dec','Jan','Aug','Sep','Apr','Mar','Feb', 'May','Jun', 'Jul','Oct','Nov']


def my_replace(text, text_correct):

    for each_text in text_correct:
        text = re.sub(f'.*{each_text}.*', each_text, text)
    
    return text

ds_mes.apply(my_replace, text_correct=months_correct).value_counts()

Jul    306
Aug    291
Sep    253
Jun    223
Oct    181
       153
May    138
Apr    133
Nov    104
Mar     88
Dec     55
Feb     48
Jan     43
Name: Date, dtype: int64

## In USA the shark attacks were more intense in summer

In [623]:
mask = shark_list['Country'] == 'AUSTRALIA'
shark_aus = shark_list[mask]
shark_aus

        Country Sex          Date
3     AUSTRALIA    M    17-Sep-16
4     AUSTRALIA    M    16-Sep-16
10    AUSTRALIA    M    05-Sep-16
22    AUSTRALIA    M    28-Jul-16
24    AUSTRALIA    M    26-Jul-16
...         ...  ...          ...
5984  AUSTRALIA    M  Before 1906
5985  AUSTRALIA    M  Before 1906
5986  AUSTRALIA    M  Before 1906
5987  AUSTRALIA    M  Before 1903
5988  AUSTRALIA    M  Before 1903

[1136 rows x 3 columns]

In [624]:
df_aus = pd.DataFrame(shark_aus['Sex '].value_counts().reset_index().rename(columns = {'index':'Gender', 'Sex ': 'Qtd'}))
df_aus_porcentagem = df_aus['Qtd']/(df_aus['Qtd'].sum())
df_aus_porcentagem

0    0.929577
1    0.070423
Name: Qtd, dtype: float64

In [625]:
shark_aus["Date"].value_counts()

Before 1906    4
27-Dec-08      3
13-Mar-77      3
20-May-66      3
12-Feb-06      2
              ..
21-Nov-93      1
10-Feb-16      1
10-Jul-04      1
15-Jan-66      1
12-Mar-29      1
Name: Date, Length: 1085, dtype: int64

In [626]:
pattern = '\-(\D+)\-'
mes = shark_aus['Date'].apply(lambda x: re.findall(pattern, x))     
mes

3       [Sep]
4       [Sep]
10      [Sep]
22      [Jul]
24      [Jul]
        ...
5984       []
5985       []
5986       []
5987       []
5988       []
Name: Date, Length: 1136, dtype: object

In [627]:
ds_mes = pd.Series(mes)
ds_mes.value_counts()

[Jan]         166
[Dec]         144
[Feb]         123
[Nov]         114
[Mar]         102
[]             90
[Apr]          89
[Oct]          77
[Jun]          53
[Sep]          48
[Aug]          45
[May]          45
[Jul]          38
[ Jan]          1
[Mar, Mar]      1
Name: Date, dtype: int64

In [628]:
ds_mes = ds_mes.apply(lambda x : x[0] if len(x)>0 else '')
ds_mes

3       Sep
4       Sep
10      Sep
22      Jul
24      Jul
       ...
5984
5985
5986
5987
5988
Name: Date, Length: 1136, dtype: object

In [629]:
months_correct = ['Dec','Jan','Aug','Sep','Apr','Mar','Feb', 'May','Jun', 'Jul','Oct','Nov']


def my_replace(text, text_correct):

    for each_text in text_correct:
        text = re.sub(f'.*{each_text}.*', each_text, text)
    
    return text

ds_mes.apply(my_replace, text_correct=months_correct).value_counts()

Jan    167
Dec    144
Feb    123
Nov    114
Mar    103
        90
Apr     89
Oct     77
Jun     53
Sep     48
Aug     45
May     45
Jul     38
Name: Date, dtype: int64

## In Australia, the shark attacks were more intense in summer with men

In [638]:
shark_aus.to_csv('Shark_aus.csv')

In [639]:
shark_usa.to_csv('Shark_usa.csv')